package homeWork.HW1;

public class Hw1_1 {

    public static void main(String[] args) {
        for (int i = 3; i > 0; i--) {
            System.out.println(i);
        }
        System.out.println("Поехали!!!");
    }
}


/*Написать программу которая будет печатать/выводить следующий текст:
3
2
1
Поехали!!!
*/