package homeWork.HW4;

public class Hw4_2 {
    public static void main(String[] args) {
        int i=0;
        int summ = 5;
        while (summ<=100000) {
            summ=summ*5;
            i++;
            System.out.println(i);
        }
    }
}



/*
* */


/*Задача №2

Необходимо вывести все положительные степени числа 5 до тех пор,
пока результат возведения в степень меньше 100000, вывести результат возведения в степень.

 * */