package homeWork.HW2;

public class Hw2_1 {
    public static void main(String[] args) {
        int a = 5;
        int b = 9;
        System.out.println("Сложение: " + (a + b));
        System.out.println("Умножение: " + (a * b));
        System.out.println("Вычитание: " + (a - b));
        System.out.println("Деление: " + (a / b));
        System.out.println("Остаток от деления: " + (a % b));
        System.out.println("Проверка на четность переменной a: " + (a % 2 == 0));
        System.out.println("Проверка на четность переменной b: " + (b % 2 == 0));

    }
}


/*Задача №1

Необходимо создать целочисленные переменные a и b,
присвоить произвольные значения переменным на ваш выбор и вывести результаты
следующих операций с этими переменными: сложение, умножение, вычитание, деление и остаток от деления.
Также сделать проверку на четность этих переменных и вывести результат.
* */