package homeWork.HW2;

public class Hw2_2 {
    public static void main(String[] args) {
        int a = 2;
        int b = 6;
        int c;
        c=b;
        b=a;
        a=c;
        System.out.println("a = " + a);
        System.out.println("b = " + b);
    }
}


/*Задача №2
Необходимо создать целочисленные переменные a и b,
присвоить им произвольные значения,
а потом поменять значения местами (значение переменной a должно оказаться в переменной b и наоборот).*/


